# 题目描述
# 一组无序的自然数集合，由0,1,2... ...,n的数字和一个的数字X（X>=0 && X<=n）组成，请从集合中找出这个重复数字X。
# 输入描述:
# 空格分割的自然数集合
# 输出描述:
# 重复数字
# 示例1
# 输入
#
# 9 6 4 2 1 3 5 7 0 1 8
# 输出
#
# 1
# 说明
#
# 0,1,2,3,4,5,6,7,8,9 + 1
# 示例2
# 输入
#
# 3 0 2 2 1
# 输出
#
# 2
# 说明
#
# 0,1,2,3 + 2
n_list = list(map(int, input().split()))

# n_list.sort()
# for i in range(1, len(n_list)):
#     if n_list[i - 1] == n_list[i]:
#         print(n_list[i])


# 输入数组为0-n连续的正整数
# 故结果为 输入数组的和 - 从0开始累加到比输入数组长度少1的和

print(sum(n_list) - sum(range(len(n_list) - 1)))
